[
  "secure-login-update.com",
  "verify-account-security.net",
  "bank-account-suspended.info",
  "free-crypto-giveaway.org",
  "amazon-order-verify.com",
  "netflix-subscription-cancel.net",
  "apple-id-locked-alert.com",
  "microsoft-support-alert.tk",
  "paypal-transaction-dispute.com",
  "usp-delivery-fail.net",
  "google-drive-share-file.com",
  "facebook-login-check.com",
  "instagram-badge-verify.net",
  "whatsapp-web-login.com",
  "telegram-web-login.org",
  "win-iphone-15.com",
  "claim-lottery-prize.net",
  "urgent-account-action.com",
  "secure-payments-login.com",
  "account-verification-center.net",
  "update-kyc-now.info",
  "banking-alert-support.com",
  "online-banking-secure.net",
  "verify-your-identity.org",
  "customer-support-alert.com",
  "account-recovery-center.net",
  "payment-failed-alert.com",
  "reset-password-now.com",
  "login-protection-service.com",
  "confirm-transaction-online.net",
  "billing-issue-notice.com",
  "suspicious-activity-alert.net",
  "verify-shipping-address.com",
  "tax-refund-claim-now.com",
  "govt-benefit-claim.org",
  "digital-wallet-alert.com",
  "upi-transaction-failed.net",
  "card-blocked-notification.com",
  "URGENT: Your bank account has been temporarily blocked due to suspicious activity. Verify immediately to restore access.",
  "Alert! Unauthorized transaction detected on your credit card. Confirm details immediately.",
  "Your UPI payment failed due to verification issues. Update now to complete the transaction.",
  "Final Notice: Your account will be suspended today. Verify your identity to continue services.",
  "Security Alert: Multiple failed login attempts detected. Confirm your credentials immediately.",

  "Your KYC is incomplete. Services will be stopped within 24 hours. Update now.",
  "PAN linked to suspicious transactions. Immediate verification required to avoid legal action.",
  "Income Tax refund pending. Submit details today to process refund.",
  "Aadhaar verification failed. Update information immediately to continue benefits.",

  "Delivery attempt failed. Please confirm your address to receive the package.",
  "Your shipment is on hold due to incomplete details. Update address now.",
  "Package pending at warehouse. Action required to avoid return.",

  "Congratulations! You have won a cash prize worth Rs.10,00,000. Claim now before expiry.",
  "You have been selected for an exclusive reward. Respond immediately to claim.",
  "Free gift voucher waiting for you. Limited time offer – claim now.",

  "Security Alert: Your social media account shows unusual activity. Verify now to prevent permanent lock.",
  "Your account violated our policies and will be disabled. Confirm ownership immediately.",
  "Someone tried to log in from a new device. Secure your account now.",

  "Microsoft Security Alert: Malware detected on your device. Immediate action required.",
  "Your system is at high risk. Contact support now to prevent data loss.",
  "Virus detected. Click link to remove threats immediately.",

  "Dear user, your account access will be restricted. Verify immediately: http://account-update-now.net Support: +18001234567",
  "Urgent Action Required: Suspicious login and failed payment detected. Confirm identity now.",
  "Bank notice: Your card has been blocked. Verify now or contact +91XXXXXXXXXX immediately.",

  "Action required immediately.",
  "Verify now to continue.",
  "Account locked. Update info.",
  "Click link to avoid suspension."
]

